Python/py_simulator.org
# ################################################
#+STARTUP: hidestars
#+STARTUP: showall
#+OPTIONS: toc:t num:t H:3
#+LATEX_CLASS: tufte-handout
#+LATEX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{tufte-textbook}
# Define subtitle after, since the new \subtitle macro is in the textbook.sty file:
#+LATEX_HEADER: \subtitle{(new-symbol.lisp)}
# +LATEX_HEADER: \makeindex
# +LATEX_HEADER: \asPublished
# +LATEXT_HEADER: \hideSources
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setenumerate{itemsep=-3pt,topsep=0pt}
#+MACRO: marginnote @@latex:\marginnote[$2]{$1}@@@@html:<span class="marginnote">$1</span>@@
#+LATEX_HEADER: \setitemize{itemsep=-3pt,topsep=0pt}
#+MACRO: source @@latex:\source{$1}@@
#+MACRO: latex @@latex:\LaTeX{}@@@@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>&Chi;</span>@@
#+HTML_HEAD: <link rel="stylesheet" href="my-tufte.css"/>
#+TITLE: A Simple Robot Simulator in Python
#+AUTHOR: Roy M. Turner
#+DATE:Fall 2022
#+LATEX_CLASS_OPTIONS: [11pt]
# Fix the margins -- following from Clark Donley (clarkdonley.com)
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
# This line makes lists work better:
# It eliminates whitespace before/within a list and pushes it tt the left margin
# +LATEX_HEADER: \usepackage{enumitem}
# #################################################

@@latex:\titlepage
\maketitle@@

* Description

This is a very simple "robot world"  simulator for use by COS 470/570  students for the search assignment. It allows you to define a rectangular world and add some obstacles and/or one or more robots.  It provides a base class for robots (=Robot=) that you can subclass to create your own robots.  All you have to do is create a new class based on =Robot= and define a method =agent_program= to encode your agent's intelligence.  =agent_program= accepts a single argument, =percept= (see below), and it returns a string naming the next action to take (see below).  You can add your gent to the simulator, then use its =run= method to run the simulation.

There are also functions available give you all of the obstacle locations for when you implement (e.g.) your A^* search, as well as a very simple method to show you an overview of the current world.

* Loading the simulator

First, make sure that the file =py_simulator.py= is in Python's current working directory.  You may also want to use things from these files, too, and if so, put them in the current working directory, too:
- =py_symbol.py= -- a "symbol" (really, unique string) generator
- =py_messages.py= -- a facility for writing messages to the user

You can load these in the normal Python way using =import=.  I'd suggest either something like:
: import py_simulator as sim
or
: from py_simulator import *
\noindent for all three, just to make your typing life easier.

* Creating a simulator

To create a simulator instance, do something like:
: s = Simulator(size=[20,20])
\noindent assuming that you have loaded it with "from" as above, else do something like:
: s = sim.Simulator(size=[20,20])
\noindent if you used the "import...as" form.

The default size is 10\times 10, with no obstacles, which is what you get if you just do:
: s = Simulator()

You can specify obstacles in one of two ways.  First, using the =num_obstacles= keyword parameter:
: s = Simulator(num_obstacles=10)
@@latex:\noindent@@
\noindent which will insert (in this case) 10 obstacles in random locations.  If you want them in particular places, you would use the second method and say exactly where you want them:
: s = Simulator(obstacle_locations=[[1,1], [3,4], [10,10]])
@@latex:\noindent@@ *Note:* The world coordinates 1-based and in =[row,column]= format, starting from the top for =row= and from the left for =column=.

* Example
An example "random" robot is included, implemented by class =RandomRobot=.  To see it in action, do:
#+begin_src python
from py_simulator import *

# Create the simulator:
s = Simulator()

# Add a robot:
s.add_robot(robot_type='RandomRobot'))

# Put in some obstacles -- could have done this when instantiating Simulator,
# too:
s.add_random_obstacles(number=10)

# Display the world:
s.draw()

# Run for one "clock tick"...
s.run()
# ...and show the world again:
s.draw()

# Run for 20 ticks, showing the world each time:
s.run(20,show_each=True)
#+end_src

* Creating a new robot type

To run your agent code, you'll need to create a new kind of robot and add it to the simulator.  I have provided a base class for you to use, =Robot=, whose =__init__= method defines instance variables for =name=, =location=, =orientation= (\in {'north', 'south', 'east', 'west'} -- i.e., /world/ directions), the most recent percept calculated (=percept=), the next action the agent is requesting (=next_action=), the previous action taken (=prev_action=), and the status of the last action taken (=prev_action_status= = True or False, for successful or not, respectively).

Your agent program should not access these directly, of course, since even though they are in the agent (the =Robot= instance), they are really simulation variables, not information the agent program should have.  Most of your agents, for example, will not know anything about the world except as revealed via the percepts, and they will "think" in terms of forward, backward, left, right, etc., not north, south, east, or west.  Your model agent will have to keep its own model of the world in those terms, for example.  

Your hill-climbing agent will need a heuristic function that does know about the world, but this should be opaque to your agent program: it should call the heuristic function with local references ("what is the square in front of me worth?") and the heuristic function would map that into world coordinates as needed to determine the value to return.  Thus, your heuristic function is actually a kind of simulation function or interface to the simulator rather than an agent function per se, but should be defined as a method of the =Robot= (or its subclasses you're defining).

For your uniform cost and A^* agent, you can directly use methods of =World= (in the simulator's =world= instance variable) to build whatever kind of map or representation, as well as heuristic functions, you choose to implement.  See the section below about the =World= class for methods that might be useful.

To run your code, you will need to create another robot class based on =robot= and define its =agent_program= method to run your code.  (In fact, you will create a different robot class for each of the parts of the assignment, most likely.)  I have provided a sample robot class, =RandomRobot= (see below) to see how to do this.  This robot just wanders around randomly.

You want your agent program---i.e., your AI code---to be run automatically by the simulator at each "clock tick".  The simulator runs in cycles referred to here as "clock ticks".  Your agent will likely be fine just using the =Robot= class' =clock_tick= function.  

Your code should be implemented in your class' =agent_program= method, which is called with a percept and which should return an action's name to be done next.

For example, suppose you are writing your reflex agent.  All you need to do is something like this:
#+begin_src python
class ReflexAgent (Robot):
    def agent_program(self,percept):
        # your brilliant code goes here; let's say
        # the action you choose to take has been
        # placed in local variable "action"; then
        # you'd do:
        return action
#+end_src

Of course, for complex agents, you wouldn't want to put all the code in =agent_program=, since that would be rather bad style (right??), so you would break it down in a nice top-down manner, defining additional methods for =agent_program= to call.

** Percept format

For the search assignment, the robots have a very  limited repertoire of sensors: just a forward-looking sonar-type thing that can  sense what is directly in front of the robot and four bump sensors, one on each side and in the front and rear, that can detect whether or not the robot bumped into something due to the /previous/ command.  An agent's =clock_tick= method calculates the current percept and passes it to the =agent_program= as an argument.

The percept is a Python dictionary with an entry for each sensor.  The sensors are named =front_sensor=, =front_bump=, =right_bump=, =left_bump=, and =rear_bump=.  Each will have a value of =True= or =False=, for example:
: {"front_sensor": True, "front_bump": False,
:  "right_bump"=False, "left_bump": True, "rear_bump": False"}
@@latex:\noindent@@ which means something in front of the robot and the robot bumped into something on its left when it tried to execute the previous action.

** Adding new percept components
<<adding-percepts>>

You won't need to do this for this assignment, but in case you decide to, here's how.
You can add new percept components to robots you define based on =Robot=.  The =Robot= class has an instance variable, =percept_map=, that contains a dictionary of the form:
: {"front_sensor": "forward_sensor", ...}
@@latex:\noindent@@ That is, each kind of sensor (e.g., ="front_sensor"=) is linked to a method (e.g., ="forward_sensor"=) that is called to give the value.  You can add your own key/value pairs to this as you need to; just don't forget to define the method called!

The method is called by =calculate_percept= (see the [[code][code]] below), a method of =Robot=.  It takes no arguments, sets the instance variable =percept=, and returns the percept as well.  

** Adding new actions

You may also want to add actions for the robot that are not provided by the standard =Robot= class.  Actions are carried out according to the =command_map= instance variable of the robot.  A command map should be a dictionary of the form: 
: {"nop": "do_nop", "forward": "do_move_forward", ...}
@@latex:\noindent@@ where the key is the command name and the value is the name of the method to call when that command is to be carried out.  The method takes no arguments. It should return =True= if it succeeds and =False= if not.  The command methods are called by the =take_action= method (see the code below), which takes care of setting =prev_action= and =prev_action_status= (based on what the command method returns).

* Adding your robot to the simulator

As shown in the example above, you can add your robot to the simulator's world using (assuming =s= contains a =Simulator= instance:
: s.add_robot(type="MyRobot")
@@latex:\noindent@@ which will create a new instance of =MyRobot= for you.  You can instead specify an existing instance by:
: s.add_robot(robot=my_robot)
\noindent where =my_robot= contains an instance of (say) =MyRobot=.

The =add_robot= method has additional parameters to allow setting the location (=location=), orientation (=orientation=), and name (=name=, which defaults to a new symbol based on =robot=).  If a location or orientation is not set, then your robot's =location= and =orientation= instance variables are used (which means that if you let the simulator create the robot instance for you, it will appear at the default location specified in your class or in =Robot= (=[1,1]=)

* World methods

There are various methods that you can use to access the world as needed, many of which have corresponding "pass through" methods defined in =Simulator= that just call their =World= counterpart.  Here are some useful ones (see the code for their parameters and return values, as well as whether they are methods of  =Simulator=, =World=, or both):
- =add_object=, =add_random_obstacle=, =add_random_obstacles= -- add objects
- =add_robot= -- add a robot
- =find_object= -- find an object, either by location or by the object instance itself (in which case, it's just a fancy "is this object in the world?" method)
- =remove_object= to get rid of an object, either by location or by the object instance itself
- =clear= -- clears the world, or the simulator and the world if you call =Simulator='s version
- =draw= -- shows a view of the world
- =empty= -- check if a location is empty
- =set_drawing_character= -- change the characters used when drawing the world
- =random_location=, =random_empty_location= -- return a random location (the second one ensures it's empty) 
- =next_location= --  given a direction and an orientation, the next location in that direction; orientation is in world coordinates, so don't use this inside your agent if it shouldn't know about that
- =opposite_direction= -- given a direction, returns the opposite one
- =clockwise_direction=, =counterclockwise_direction= -- given a direction, returns the direction just to the clockwise/counterclockwise.
- =objects=  -- world method that returns a list of object instances
- =object_locations= -- returns a list of  locations occupied objects
- =in_bounds= -- given a location, returns True/False depending on if it is in-bounds or not

I can't stress enough, however, that you *must* take care to keep the information you can get from the world out of the hands of the agents that should not have access to it (looking at you, reflex agent!).

* Exceptions

Some methods raise exceptions when there is a problem so you can use Python's exception-handling facilities (e.g., =try= =... =except=) to catch errors in your code.  These exceptions are:
- =WorldException= -- a problem with something having to do with the world; includes subclasses:
  - =OutOfBounds= -- raised (e.g.) =add_object= when you try to put something outside of the world boundaries
  - =LocationOccupied=-- raised (e.g.) by =add_object= when you try to put something where there is something already
- =DirectionError= -- raised (e.g.) by =next_location= if you give it a bad direction

* Using the messaging methods

The file =py_messages.py= defines a class, =MessageHandler=, and the methods =msg=, =vmsg=, =dmsg=, and =vdmsg= (yes, I know what that sounds like) to allow you to control the verbosity of messages printed by your code.  To use these, do something like:
: from py_messages import *
and then  instantiate =MessageHandler=, e.g.:
: m = MessageHandler()

By default, the verbosity of output is set so that only =msg= methods produce output.  You can control this by setting the verbosity of the message handler, e.g.,
: m.set_verbosity(verb)
\noindent where =verb= is one of these strings:
- ='silent'= -- turn off all messages
- ='normal'= -- only =msg= produces output
- ='verbose'=  -- in addition to =msg=, =vmsg= also produced output
- ='debugging'= -- in addition to the above, =dmsg= produces output
- ='verbose_debugging'= -- =vdmsg= also outputs stuff at this level

As you can see in the code below, I usually define instance variables and methods of my classes to make it easier to use the message methods and to avoid dependencies on a global variable holding the =MessageHandler= instance; this also allows each object to have different verbosities, since each has their own =MessageHandler= instance.  For example:
#+begin_src python
class MyClass():
    
    def __init__(self):
        self.mh = MessageHandler()

    def msg(self,m):
        self.mh.msg(m)
    def dmsg(self,m):
        self.mh.dmsg(m)
    def vmsg(self,m):
        self.mh.vmsg(m)
    def vdmsg(self,m):
        self.mh.vdmsg(m)
#+end_src

This way, from methods of =MyClass= can do:
: self.msg('hi there')

Something that is very useful is (Python 3 only) string interpolation, too, e.g.:
: self.msg(f'The objects are {self.objects()}.')


