Python/py_simulator.org
* Simulating your work

The major function to use to run your simulation is just =run=.  (Original, no?)  This has two optional parameters:
- =ticks= -- how many clock-ticks to run for
- =show_each= -- show the state of the world after each clock tick
So if you want to run it for 10 seconds (if that's what you want  clock ticks to represent, and assuming =s= contains a =Simulator= instance):
: s.run(ticks=10,show_each=True)

I have provided a (very) simple way to show the world, the =draw= methods of =Simulator= and =World=. These have keyword arguments that allow you to change what characters look like, or use =set_drawing_character= to do that.

Here is an example of what the world looks like for a 10 \times 10 world:
: ++++++++++++
: +...<......+
: +..........+
: +..........+
: +..........+
: +..........+
: +..........+
: +..........+
: +..........+
: +..........+
: +..........+
: ++++++++++++
#+end_verbatim
\noident Not pretty, but functional.

The character output for each object is obtained by this method by calling each object's =icon= method, which should return a single character.  The =Robot= version of this outputs a pointer-like symbol to indicate its orientation.  You can change this for your agents if you like.

* Code
<<code>>

** Module setup

Here is the module setup; see above for how to load simulator.  Note that this documentation is being produced from an Org Mode literate programming file that contains both Python and Lisp versions of the simulator.  Feel free to ignore the Lisp code (I know you will want to!).

#+begin_src python +n -i :tangle yes :comments link
from py_symbol import *
from py_messages import *
from random import randint
#+end_src

Now create a global symbol generator for all objects to use:
#+begin_src python +n -i :tangle yes :comments link
symbolGen = SymbolGenerator()
#+end_src

** Object class: Simulated objects

The =Object= class represents simulation objects, for example, obstacles.  Robots and other objects can be built on this class.


#+begin_src python +n -i :tangle yes :comments link
class Object():
    #+end_src

This initializes several instance variables based on the (optional, keyword) parameters to the instantiation function:

#+begin_src python +n -i :tangle yes :comments link
    def __init__(self,name=None,location=[1,1], orientation="north",icon='@'):
        self.name = name if name else symbolGen.new_symbol("obj")
        self.location = location
        self.orientation = orientation
        self.icon_char = icon
        self.world = None
        self.mh = MessageHandler()

#+end_src

Along with the =mh= instance variable, these methods allow using the messaging functions by just using other methods of the object, e.g., =self.msg('hi')= passes calls the corresponding method of =MessageHandle=.

#+begin_src python +n -i :tangle yes :comments link
    def msg(self,m):
        self.mh.msg(m)
    def dmsg(self,m):
        self.mh.dmsg(m)
    def vmsg(self,m):
        self.mh.vmsg(m)
    def vdmsg(self,m):
        self.mh.vdmsg(m)
#+end_src

Define a =clock_tick= method that is just a placeholder for those defined for subclasses.

#+begin_src python +n -i :tangle yes :comments link
    def clock_tick(self):
        pass
#+end_src

This lets =World='s =draw= method know what this object's icon should be.

#+begin_src python +n -i :tangle yes :comments link
    def icon(self):
        return self.icon_char

#+end_src

