Python/py_simulator.py
from py_symbol import *
from py_messages import *
from random import randint
# Module setup:1 ends here

# [[file:py_simulator.org::*Module setup][Module setup:2]]
symbolGen = SymbolGenerator()
# Module setup:2 ends here

# [[file:py_simulator.org::*Object class: Simulated objects][Object class: Simulated objects:1]]
class Object():
# Object class: Simulated objects:1 ends here

# [[file:py_simulator.org::*Object class: Simulated objects][Object class: Simulated objects:2]]
    def __init__(self,name=None,location=[1,1], orientation="north",icon='@'):
        self.name = name if name else symbolGen.new_symbol("obj")
        self.location = location
        self.orientation = orientation
        self.icon_char = icon
        self.world = None
        self.mh = MessageHandler()
# Object class: Simulated objects:2 ends here

# [[file:py_simulator.org::*Object class: Simulated objects][Object class: Simulated objects:3]]
    def msg(self,m):
        self.mh.msg(m)
    def dmsg(self,m):
        self.mh.dmsg(m)
    def vmsg(self,m):
        self.mh.vmsg(m)
    def vdmsg(self,m):
        self.mh.vdmsg(m)
# Object class: Simulated objects:3 ends here

# [[file:py_simulator.org::*Object class: Simulated objects][Object class: Simulated objects:4]]
    def clock_tick(self):
        pass
# Object class: Simulated objects:4 ends here

# [[file:py_simulator.org::*Object class: Simulated objects][Object class: Simulated objects:5]]
    def icon(self):
        return self.icon_char
# Object class: Simulated objects:5 ends here
