Python/py_simulator.org
** World class

The =World= class holds a representation of the current state of the world.  Before defining those, though, we first define the exception classes used by the =World= when there are problems

#+begin_src python +n -i :tangle yes :comments link
class WorldException(Exception):
    pass
class OutOfBounds(WorldException):
    pass
class LocationOccupied(WorldException):
    pass

class DirectionError(WorldException):
    pass

#+end_src



Here is the class and its =__init__= method.  The world can be initialized with different sizes, numbers of obstacles automatically created in random locations, or obstacles placed at particular locations.  The class variables provide some default characters to use when drawing the world.  These can be overridden (see below).

#+begin_src python +n -i :tangle yes :comments link
class World():
    empty_char='.'
    side_wall_char='+'
    top_bottom_char='+'

    def __init__(self,size=[10,10],num_obstacles=0,
                 obstacle_locations=None):
        self.size = size
        self.num_obstacles = num_obstacles
        self.obstacle_locations = obstacle_locations

        self.objects = []

        self.mh = MessageHandler()
#+end_src

Set up messaging methods.

#+begin_src python +n -i :tangle yes :comments link
    def msg(self,m):
        self.mh.msg(m)
    def dmsg(self,m):
        self.mh.dmsg(m)
    def vmsg(self,m):
        self.mh.vmsg(m)
    def vdmsg(self,m):
        self.mh.vdmsg(m)
#+end_src

Use this method to set the drawing character(s) for the sides, top and bottom, and/or empty spaces.
#+begin_src python +n -i :tangle yes :comments link

    def set_drawing_character(self,empty=None,side_wall=None,
                              top_bottom=None):
        self.empty_char = empty if empty else World.empty_char
        self.side_wall_char = side_wall if side_wall \
            else World.side_wall_char
        self.top_bottom_char = top_bottom if top_bottom else \
            World.top_bottom_char

#+end_src

Return =True= if the location passed is empty.

#+begin_src python +n -i :tangle yes :comments link
    def empty(self,location):
        if not self.in_bounds(location):
            return False
        else:
            for object in self.objects:
                if object.location == location:
                    return False
            return True
#+end_src

Return =True= if the location passed is inside the world's boundaries.
#+begin_src python +n -i :tangle yes :comments link

    def in_bounds(self,loc):
        (x,y) = loc
        (max_x,max_y) = self.size
        return False if x < 1 or y < 1 or x > max_x or y > max_y else True

#+end_src

Add an object to the world.  If you specify a location (a tuple or list), then this will insert an instance of =Object= at that location.  If you pass an object (e.g., a robot, obstacle, etc.), then that will be put into the world at the location specified in its =location= instance variable.

If the location is out of bounds or the location is occupied, this raises an exception.

Note that this adds (or at least, sets) the added object's =world= instance variable so that other methods can access the world.  So after this is called, a method of the object can call, e.g., =self.world.next_location([5,5],'north')= to find the location to the North of the given location.

#+begin_src python +n -i :tangle yes :comments link
    def add_object(self,object):
        if type(object) == list or type(object) == tuple:
            object = Object(location=object)

        self.vdmsg(f'(adding object {object.name} to world)')

        object.world = self                  # so it can do its own percepts

        if not self.in_bounds(object.location):
            raise OutOfBounds()
        elif not self.empty(object.location):
            raise LocationOccupied
        else:
            self.objects.append(object)
#+end_src

This clears the world of obstacles.

#+begin_src python +n -i :tangle yes :comments link
    def clear(self):
        self.vdmsg('(clearing world)')
        self.objects = []

#+end_src

This returns a list of locations at which there are objects in the world.  Note that this will return any robots' locations, too.  For a list all objects, use the =World= instances' =objects= instance variable directly.

#+begin_src python +n -i :tangle yes :comments link
    def object_locations(self):
        return [obj.location for obj in self.objects]
#+end_src

These two methods do the same thing: just remove an object from the world.  Which object to remove can be specified either as a location (tuple or list) or as the actual object to be removed.[fn:3]

#+begin_src python +n -i :tangle yes :comments link
    def delete_object(self,object):
        return self.remove_object(object)

    def remove_object(self,object):
        object = self.find_object(object)
        if not object:
            self.vdmsg(f'(remove_object: object {object.name} not found)')
            return None
        else:
            i = self.objects.index(object)
            self.objects = self.objects[0:i] + self.objects[i+1:]
            self.vdmsg(f'(remove_object: removed {object.name})')
            return object
#+end_src

Find an object in the world and return it.  If you give a location (tuple, list), then this will return the object at that location, if one is there.  If you give it an object instance, it will return the object if it is in the world's list of objects---in other words, this can double as an "is this object in the world?" method.

#+begin_src python +n -i :tangle yes :comments link
    def find_object(self,description):
        if type(description) == list:
            return self.find_object_by_location(description)
        else:
            for obj in self.objects:
                if obj is description:
                    return obj
            return None

    def find_object_by_location(self,loc):
        for obj in self.objects:
            if loc == obj.location:
                return obj
        return None
#+end_src

Draw a simple depiction of the world.

#+begin_src python +n -i :tangle yes :comments link
    def draw(self):
        self.draw_line(self.top_bottom_char)
        self.draw_rows(self.empty_char,self.side_wall_char)
        self.draw_line(self.top_bottom_char)
        
    def draw_line(self,char):
        print((self.size[1]+2)*char)

    def draw_rows(self,empty,wall):
        for i in range(self.size[0]):
            print(wall,end='')
            self.draw_row(i+1,empty)
            print(wall)

    def draw_row(self,row,empty):
        for col in range(self.size[1]):
            obj = self.find_object([row,col+1])
            if obj:
                print(obj.icon(),end='')
            else:
                print(empty,end='')

#+end_src

This returns a random empty location in the world. 

The method could be improved, since it just tries to find an empty location randomly, and returns if it hasn't found one after trying once for every location in the world---so there are times it may not find one, even if one is available.  We could (should?) change this to first make a list of all empty location, then return a random element of that list, thus guaranteeing we find one.  The trade-off is time:  for sparsely-populated, large worlds, this will be much quicker.

#+begin_src python +n -i :tangle yes :comments link
    # return empty location
    def empty_location(self):
        for i in range(self.size[0]*self.size[1]):
            loc = [randint(1,self.size[0]),randint(1,self.size[0])]
            if self.empty(loc):
                return loc
        self.dmsg('No empty squares found after row*column tries.')
        return None

#+end_src

These methods: find the next location in the given orientation; find the direction opposite the one given; and find the direction just to clockwise or counterclockwise of the given direction.  If you give one of them an invalid direction, they will raise an exception.

#+begin_src python +n -i :tangle yes :comments link
    # Note: we're going w/ row,column rather than x,y now:
    def next_location(self,location,direction):
        if direction == 'north':
            return [location[0]-1,location[1]]
        elif direction == 'south':
            return [location[0]+1,location[1]]
        elif direction == 'east':
            return [location[0],location[1]+1]            
        elif direction == 'west':
            return [location[0],location[1]-1]
        else:
            raise DirectionError()

    def opposite_direction(self,direction):
        if direction == 'north':
            return 'south'
        elif direction == 'south':
            return 'north'
        elif direction == 'east':
            return 'west'
        elif direction == 'west':
            return 'east'
        else:
            raise OrientatioError()

    def clockwise_direction(self,direction):
        if direction == 'north':
            return 'east'
        elif direction == 'south':
            return 'west'
        elif direction == 'east':
            return 'south'
        elif direction == 'west':
            return 'north'
        else:
            raise DirectionError()

    def counterclockwise_direction(self,direction):
        return self.opposite_direction(self.clockwise_direction(direction))

#+end_src

This allows you to set the location for the object by calling the corresponding method of =World=.

#+begin_src python +n -i :tangle yes :comments link
    def set_drawing_character(self,empty=None,side_wall=None,
                              top_bottom=None):
        self.world(set_drawing_character(empty=empty,side_wall=side_wall,
                                         top_bottom=top_bottom))


#+end_src

