Python/py_simulator.org
** Simulator class

This is the class that represents the simulator itself.  It creates and contain an instance of =World=.  You can set the world's size and initial  obstacle content by passing the appropriate parameters to the instantiation as well; for details, see =World='s =__init__= method.

#+begin_src python +n -i :tangle yes :comments link
class Simulator():
    def __init__(self,size=[10,10],num_obstacles=0,obstacle_locations=None):
        self.time = 0
        self.world = World(size=size,num_obstacles=num_obstacles,
                           obstacle_locations=obstacle_locations)
        self.mh = MessageHandler()
#+end_src

Set up messaging methods for this object.
#+begin_src python +n -i :tangle yes :comments link
    def msg(self,m):
        self.mh.msg(m)
    def dmsg(self,m):
        self.mh.dmsg(m)
    def vmsg(self,m):
        self.mh.vmsg(m)
    def vdmsg(self,m):
        self.mh.vdmsg(m)

#+end_src

Clear the world (=clear=) or clear the world  and reset the timer (=reset=).

#+begin_src python +n -i :tangle yes :comments link
    def clear(self):
        self.world.clear()
        self.msg('Cleared.')

    def reset(self):
        self.clear()
        self.time = 0
#+end_src

Methods for adding objects.  

=add_obstacles= just calls =add_objects=, which calls =World='s =add_object= method for each object specified (see that method for details about object specification).  

=add_random_obstacles= adds multiple obstacles in random locations.  You can specify the number to add, the maximum to add, and the minimum to add.  If you don't specify a number, this creates a random number (between the minimum and the maximum, inclusive) of obstacles.

#+begin_src python +n -i :tangle yes :comments link

    def add_obstacles(self,loc_list):
        return self.add_objects(loc_list)

    # "loc_list" can be a list of locations or actual object instances:
    def add_objects(self,loc_list):
        for loc in loc_list:
            self.world.add_object(loc)

    def add_object(self,loc_or_obj):
        return self.world.add_object(loc_or_obj)

    def add_random_obstacles(self,number=None,max=20,min=1):
        if number == None:
            number = randint(min,max)
        for i in range(number):
            self.add_random_obstacle()

    def add_random_obstacle(self):
        self.world.add_object(self.world.empty_location())

    def add_robot(self,robot=None,name=None,location=None,orientation=None,
                  robot_type='Robot'):
        if location and not self.empty(location):
            self.msg(f"Can't add robot at {location}: not empty or out of bounds.")
            return False
        if robot is None:
            robot = eval(f'{robot_type}()')
            robot.location = location if location else self.world.empty_location()
            robot.orientation = location if location else directions[randint(0,3)]
        else:
            if location:
                robot.location = location
            if orientation:
                robot.orientation = orientation

        self.dmsg(f'Adding robot {robot.name} at {robot.location}, orientation {robot.orientation}')
        return self.add_object(robot)
#+end_src

These are methods that just call their counterparts of =World=; see the description for those methods.

#+begin_src python +n -i :tangle yes :comments link
    def find_object(self,description):
        return self.world.find_object(description)

    def delete_object(self,object):
        self.world.delete_object(object)

    def remove_object(self,object):
        self.world.delete_object(object)

    def random_location(self):
        return [randint(1,self.world.size[0]),randint(1,self.world.size[1])]

    def random_empty_location(self):
        self.world.empty_location()


    def draw(self,empty_char='.',side_wall_char='+',top_bottom_char='+'):
        self.world.draw()
#+end_src

This runs the simulator.  By default, it runs for a single "clock tick" and does not draw the world.  You can set =ticks= to the number of ticks you would like it to run, and you can set =show_each= to =True= to have it draw the world after each clock tick.

#+begin_src python +n -i :tangle yes :comments link
    def run(self,ticks=1,show_each=False):
        self.msg(f'Running for {ticks} ticks.')
        for i in range(ticks):
            self.clock_tick()
            if show_each:
                self.draw()

#+end_src

This just calls each object's =clock_tick= method, then increments the simulated time.

#+begin_src python +n -i :tangle yes :comments link
    def clock_tick(self):
        self.dmsg('.')
        for object in self.world.objects:
            object.clock_tick()
        self.time += 1
#+end_src


