Python/py_simulator.py
# World class:15 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:1]]
class Simulator():
    def __init__(self,size=[10,10],num_obstacles=0,obstacle_locations=None):
        self.time = 0
        self.world = World(size=size,num_obstacles=num_obstacles,
                           obstacle_locations=obstacle_locations)
        self.mh = MessageHandler()
# Simulator class:1 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:2]]
    def msg(self,m):
        self.mh.msg(m)
    def dmsg(self,m):
        self.mh.dmsg(m)
    def vmsg(self,m):
        self.mh.vmsg(m)
    def vdmsg(self,m):
        self.mh.vdmsg(m)
# Simulator class:2 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:3]]
    def clear(self):
        self.world.clear()
        self.msg('Cleared.')

    def reset(self):
        self.clear()
        self.time = 0
# Simulator class:3 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:4]]
    def add_obstacles(self,loc_list):
        return self.add_objects(loc_list)

    # "loc_list" can be a list of locations or actual object instances:
    def add_objects(self,loc_list):
        for loc in loc_list:
            self.world.add_object(loc)

    def add_object(self,loc_or_obj):
        return self.world.add_object(loc_or_obj)

    def add_random_obstacles(self,number=None,max=20,min=1):
        if number == None:
            number = randint(min,max)
        for i in range(number):
            self.add_random_obstacle()

    def add_random_obstacle(self):
        self.world.add_object(self.world.empty_location())

    def add_robot(self,robot=None,name=None,location=None,orientation=None,
                  robot_type='Robot'):
        if location and not self.empty(location):
            self.msg(f"Can't add robot at {location}: not empty or out of bounds.")
            return False
        if robot is None:
            robot = eval(f'{robot_type}()')
            robot.location = location if location else self.world.empty_location()
            robot.orientation = orientation if orientation else self.world.directions[randint(0,3)]
        else:
            if location:
                robot.location = location
            if orientation:
                robot.orientation = orientation

        self.dmsg(f'Adding robot {robot.name} at {robot.location}, orientation {robot.orientation}')
        return self.add_object(robot)
# Simulator class:4 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:5]]
    def empty(self,location):
        return self.world.empty(location)

    def empty_location(self):
        return self.world.empty_location()

    def find_object(self,description):
        return self.world.find_object(description)

    def delete_object(self,object):
        self.world.delete_object(object)

    def remove_object(self,object):
        self.world.delete_object(object)

    def random_location(self):
        return [randint(1,self.world.size[0]),randint(1,self.world.size[1])]

    def random_empty_location(self):
        self.world.empty_location()


    def draw(self,empty_char='.',side_wall_char='+',top_bottom_char='+'):
        self.world.draw()
# Simulator class:5 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:6]]
    def run(self,ticks=1,show_each=False):
        self.msg(f'Running for {ticks} ticks.')
        for i in range(ticks):
            self.clock_tick()
            if show_each:
                self.draw()
# Simulator class:6 ends here

# [[file:py_simulator.org::*Simulator class][Simulator class:7]]
    def clock_tick(self):
        self.dmsg('.')
        for object in self.world.objects:
            object.clock_tick()
        self.time += 1
