Python/py_simulator.org
** Robot class

This is the base class you should use for your agents.

#+begin_src python +n -i :tangle yes :comments link
class Robot(Object):
    #+end_src
    
The commands and percepts the =Robot= knows about are defined as class variables, which =__init__= then copies to corresponding instance variables if no different ones are specified when the object is instantiated.  These are described above.

#+begin_src python +n -i :tangle yes :comments link
    command_map = {"nop": "do_nop",
                   "forward": "do_move_forward",
                   "backward": "do_move_backward", 
                   "left": "do_move_left", 
                   "right": "do_move_right", 
                   "turn_right": "do_turn_clockwise",
                   "turn_left": "do_turn_counterclockwise"}

    percept_map = {"front_sensor": "forward_sensor", 
                   "front_bump": "front_bump_sensor", 
                   "rear_bump": "rear_bump_sensor", 
                   "right_bump": "right_bump_sensor", 
                   "left_bump": "left_bump_sensor"}

#+end_src

You can specify the location, orientation, name, and the command and percepts the robot will have here.  By default, the class variables for the commands and percepts are used, the location is [1,1], and the robot is oriented toward North.  If name is not given ='robot'= is used as the base, with the first robot being named ='robot1', etc.

#+begin_src python +n -i :tangle yes :comments link
    def __init__(self,command_map=None,percept_map=None,
                 location=[1,1],orientation='north',
                 name=None):
        super().__init__(location=location, orientation=orientation)
        self.percept = None
        self.next_action = None
        self.prev_action = None
        self.prev_action_success = None
        
        self.command_map = command_map if command_map else \
            Robot.command_map
        self.percept_map = percept_map if percept_map else \
            Robot.percept_map

        self.name = name if name else symbolGen.new_symbol('robot')


#+end_src

This is called by =clock_tick= to calculate the agent's current percept; it sets the =percept= instance variable accordingly, as well as returning the percept.

#+begin_src python +n -i :tangle yes :comments link
    def calculate_percept(self):
        percept = []
        for sensor in self.percept_map:
            func = self.percept_map[sensor]
            self.vdmsg(f'(calculate_percept({self.name}): calculating {sensor} value)')
            percept.append([sensor, eval(f'self.{func}()')])
        self.percept = percept
        return percept
#+end_src

Set the icon used; called by =World='s =draw= function.  The icon is meant to indicate the orientation.

#+begin_src python +n -i :tangle yes :comments link

    def icon(self):
        if self.orientation == 'north':
            return '^'
        elif self.orientation == 'south':
            return 'v'
        elif self.orientation == 'east':
            return '>'
        elif self.orientation == 'west':
            return '<'
        else:
            return '?'
        
            #+end_src

The =clock_tick= method calculates the percept, calls the agent program, then takes the action requested.
            
#+begin_src python +n -i :tangle yes :comments link

    def clock_tick(self):
        self.calculate_percept()
        self.next_action = self.agent_program(self.percept)
        self.take_action()
        return True

#+end_src

This is a placeholder =agent_program=---by default, since =Robot= isn't meant to really do anything by itself, it just always requests no operation (='nop'=).

#+begin_src python +n -i :tangle yes :comments link

    def agent_program(self,percept):
        self.msg(f'{self.name}: Dummy agent_program({percept}) called.')
        return 'nop'

#+end_src

Here are the default sensor methods.  The standard ones supplied provide the outputs of the forward sensor and bump sensors.

#+begin_src python +n -i :tangle yes :comments link
    def forward_sensor(self):
        if self.world.empty(self.world.next_location(self.location,
                                                     self.orientation)):
            return False
        else:
            return True

    def front_bump_sensor(self):
        return self.bump_sensor('forward',self.orientation)
    def rear_bump_sensor(self):
        return self.bump_sensor('backward',self.world.opposite_direction(self.orientation))
    def left_bump_sensor(self):
        return self.bump_sensor('left', self.world.counterclockwise_direction(self.orientation))
    def right_bump_sensor(self):
        return self.bump_sensor('right', self.world.clockwise_direction(self.orientation))

    def bump_sensor(self,which,direction):
        return self.prev_action == which and \
            not self.prev_action_success and \
            not self.world.empty(self.world.next_location(self.location, direction))

    ## Action methods:
    def take_action(self):
        if not self.next_action in self.command_map:
            self.msg(f'take_action for {self.name}: unknown action {self.next_action}; ' + \
                'doing nothing')
            self.next_action = "nop"
            self.prev_action_success = False
        else:
            method = self.command_map[self.next_action]
            self.msg(f'{self.name}: Performing action {self.next_action}')
            self.dmsg(f'(take_action: calling method {method})')
            self.prev_action_success = eval(f'self.{method}()')

        self.prev_action = self.next_action
        self.next_action = None
        return self.prev_action_success
#+end_src

These are the methods that are called to accomplish the commands =agent_program= requests.  See above for a description of what they do.

#+begin_src python +n -i :tangle yes :comments link

    ## actions implementation:
    def do_nop(self):
        return True

    def do_move_forward(self):
        world = self.world
        return self.move(world.next_location(self.location,self.orientation))

    def do_move_backward(self):
        world = self.world
        return \
            self.move(world.next_location(self.location,
                                          world.opposite_direction(self.orientation)))

    def do_move_left(self):
        world = self.world
        return \
            self.move(world.next_location(self.location,
                                          world.counterclockwise_direction(self.orientation)))

    def do_move_right(self):
        world = self.world
        return \
            self.move(world.next_location(self.location,
                                          world.clockwise_direction(self.orientation)))

    def move(self,location):
        if not self.world.empty(location):
            self.msg(f'{self.name}: Tried and failed to move to {location}.')
            return False
        else:
            self.location = location
            self.msg(f'{self.name} Moving to {location}.')
            return True

    def do_turn_clockwise(self):
        self.orientation = self.world.clockwise_direction(self.orientation)
        self.msg(f'{self.name}: Turning right to {self.orientation}.')
        return True

    def do_turn_counterclockwise(self):
        self.orientation = self.world.counterclockwise_direction(self.orientation)
        self.msg(f'{self.name}: Turning left to {self.orientation}.')
        return True
#+end_src

** =create_simulator= function

A function is provided to create a simulator, but really, just instantiating the =Simulator= class is just as good.

#+begin_src python +n -i :tangle yes :comments link
def create_simulator(size=[10,10],num_obstacles=0,obstacle_locations=None):
    return Simulator(size=size,num_obstacles=num_obstacles,obstacle_locations=obstacle_locations)
#+end_src

