Python/py_simulator.py
# Simulator class:7 ends here

# [[file:py_simulator.org::*Robot class][Robot class:1]]
class Robot(Object):
# Robot class:1 ends here

# [[file:py_simulator.org::*Robot class][Robot class:2]]
    command_map = {"nop": "do_nop",
                   "forward": "do_move_forward",
                   "backward": "do_move_backward", 
                   "left": "do_move_left", 
                   "right": "do_move_right", 
                   "turn_right": "do_turn_clockwise",
                   "turn_left": "do_turn_counterclockwise"}

    percept_map = {"front_sensor": "forward_sensor", 
                   "front_bump": "front_bump_sensor", 
                   "rear_bump": "rear_bump_sensor", 
                   "right_bump": "right_bump_sensor", 
                   "left_bump": "left_bump_sensor"}
# Robot class:2 ends here

# [[file:py_simulator.org::*Robot class][Robot class:3]]
    def __init__(self,command_map=None,percept_map=None,
                 location=[1,1],orientation='north',
                 name=None):
        super().__init__(location=location, orientation=orientation)
        self.percept = None
        self.next_action = None
        self.prev_action = None
        self.prev_action_success = None
        
        self.command_map = command_map if command_map else \
            Robot.command_map
        self.percept_map = percept_map if percept_map else \
            Robot.percept_map

        self.name = name if name else symbolGen.new_symbol('robot')
# Robot class:3 ends here

# [[file:py_simulator.org::*Robot class][Robot class:4]]
    def calculate_percept(self):
        percept = []
        for sensor in self.percept_map:
            func = self.percept_map[sensor]
            self.vdmsg(f'(calculate_percept({self.name}): calculating {sensor} value)')
            percept.append([sensor, eval(f'self.{func}()')])
        self.percept = percept
        return percept
# Robot class:4 ends here

# [[file:py_simulator.org::*Robot class][Robot class:5]]
    def icon(self):
        if self.orientation == 'north':
            return '^'
        elif self.orientation == 'south':
            return 'v'
        elif self.orientation == 'east':
            return '>'
        elif self.orientation == 'west':
            return '<'
        else:
            return '?'
# Robot class:5 ends here

# [[file:py_simulator.org::*Robot class][Robot class:6]]
    def clock_tick(self):
        self.calculate_percept()
        self.next_action = self.agent_program(self.percept)
        self.take_action()
        return True
# Robot class:6 ends here

# [[file:py_simulator.org::*Robot class][Robot class:7]]
    def agent_program(self,percept):
        self.msg(f'{self.name}: Dummy agent_program({percept}) called.')
        return 'nop'
# Robot class:7 ends here

# [[file:py_simulator.org::*Robot class][Robot class:8]]
    def forward_sensor(self):
        if self.world.empty(self.world.next_location(self.location,
                                                     self.orientation)):
            return False
        else:
            return True

    def front_bump_sensor(self):
        return self.bump_sensor('forward',self.orientation)
    def rear_bump_sensor(self):
        return self.bump_sensor('backward',self.world.opposite_direction(self.orientation))
    def left_bump_sensor(self):
        return self.bump_sensor('left', self.world.counterclockwise_direction(self.orientation))
    def right_bump_sensor(self):
        return self.bump_sensor('right', self.world.clockwise_direction(self.orientation))

    def bump_sensor(self,which,direction):
        return self.prev_action == which and \
            not self.prev_action_success and \
            not self.world.empty(self.world.next_location(self.location, direction))

    ## Action methods:
    def take_action(self):
        if not self.next_action in self.command_map:
            self.msg(f'take_action for {self.name}: unknown action {self.next_action}; ' + \
                'doing nothing')
            self.next_action = "nop"
            self.prev_action_success = False
        else:
            method = self.command_map[self.next_action]
            self.msg(f'{self.name}: Performing action {self.next_action}')
            self.dmsg(f'(take_action: calling method {method})')
            self.prev_action_success = eval(f'self.{method}()')

        self.prev_action = self.next_action
        self.next_action = None
        return self.prev_action_success
# Robot class:8 ends here

# [[file:py_simulator.org::*Robot class][Robot class:9]]
    ## actions implementation:
    def do_nop(self):
        return True

    def do_move_forward(self):
        world = self.world
        return self.move(world.next_location(self.location,self.orientation))

    def do_move_backward(self):
        world = self.world
        return \
            self.move(world.next_location(self.location,
                                          world.opposite_direction(self.orientation)))

    def do_move_left(self):
        world = self.world
        return \
            self.move(world.next_location(self.location,
                                          world.counterclockwise_direction(self.orientation)))

    def do_move_right(self):
        world = self.world
        return \
            self.move(world.next_location(self.location,
                                          world.clockwise_direction(self.orientation)))

    def move(self,location):
        if not self.world.empty(location):
            self.msg(f'{self.name}: Tried and failed to move to {location}.')
            return False
        else:
            self.location = location
            self.msg(f'{self.name} Moving to {location}.')
            return True

    def do_turn_clockwise(self):
        self.orientation = self.world.clockwise_direction(self.orientation)
        self.msg(f'{self.name}: Turning right to {self.orientation}.')
        return True

    def do_turn_counterclockwise(self):
        self.orientation = self.world.counterclockwise_direction(self.orientation)
        self.msg(f'{self.name}: Turning left to {self.orientation}.')
        return True
# Robot class:9 ends here

# [[file:py_simulator.org::*=create_simulator= function][=create_simulator= function:1]]
def create_simulator(size=[10,10],num_obstacles=0,obstacle_locations=None):
    return Simulator(size=size,num_obstacles=num_obstacles,obstacle_locations=obstacle_locations)
# =create_simulator= function:1 ends here
