Python/py_simulator.org
** Example: =RandomRobot=

Here is an example to help you figure out how to set up your agents.  This one is *not* one of the ones you will create, but rather just wanders around the world.

#+begin_src python +n -i :tangle yes :comments link
class RandomRobot(Robot):
    def __init__(self,command_map=None,percept_map=None,
                 location=[1,1],orientation='north',
                 name=None):
#+end_src

This calls the =Robot= class' =__init__= method to have it set up most of the robot for you.
#+begin_src python +n -i :tangle yes :comments link
        super().__init__(command_map=command_map, percept_map=percept_map,
                                   location=location, orientation=orientation,
                                   name=symbolGen.new_symbol('randrob'))

    #+end_src
    
An example agent program.  It also shows how you can use the variable verbosity messaging code from inside methods of your robot.

#+begin_src python +n -i :tangle yes :comments link
    def agent_program(self,percept):
        # Just wander around:
        keys = list(self.command_map.keys())
        self.next_action = keys[randint(0,len(keys)-1)]

        # here is how you can use msg, dmsg, etc.:
        self.dmsg(f'{self.name}: next action={self.next_action}.')

        return self.next_action              # must do this!!

#+end_src

* Vars                                                               :ignore:

* Footnotes
[fn:3]Yes, I'm aware I could have just had a class variable for =delete_object= set to =remove_object=.  I just chose not to do it. 

[fn:2]I know, this is a very verbose and redundant way to provide percepts (for example, no two bump sensors can be =t= at the same time, etc.), but it easy for you to use.   
[fn:1]Note that although loading =simulator.lisp= will load the message handler and symbol-creation packages, importing from the =simulator= package /doesn't/ import from those packages.  For that, you will have to do something like =(use-package 'message)= and =(use-package 'newsymbol)=.


# Local Variables:
# mode: org
# eval: (org-indent-mode)
# eval: (auto-fill-mode)
# eval: (flyspell-mode 1)
# eval: (setq org-export-filter-italic-functions '(beamer-italics))
# eval: (visual-line-mode)
# eval: (org-bullets-mode)
# fill-column: 20000
# End:
#
