Python/py_simulator.py

# [[file:py_simulator.org::*Example: =RandomRobot=][Example: =RandomRobot=:1]]
class RandomRobot(Robot):
    def __init__(self,command_map=None,percept_map=None,
                 location=[1,1],orientation='north',
                 name=None):
# Example: =RandomRobot=:1 ends here

# [[file:py_simulator.org::*Example: =RandomRobot=][Example: =RandomRobot=:2]]
        super().__init__(command_map=command_map, percept_map=percept_map,
                                   location=location, orientation=orientation,
                                   name=symbolGen.new_symbol('randrob'))
# Example: =RandomRobot=:2 ends here

# [[file:py_simulator.org::*Example: =RandomRobot=][Example: =RandomRobot=:3]]
    def agent_program(self,percept):
        # Just wander around:
        keys = list(self.command_map.keys())
        self.next_action = keys[randint(0,len(keys)-1)]

        # here is how you can use msg, dmsg, etc.:
        self.dmsg(f'{self.name}: next action={self.next_action}.')

        return self.next_action              # must do this!!
# Example: =RandomRobot=:3 ends here
